Repository: diaaldin/Wasslni-Plus
Catalog: lib/l10n/intl_*.arb
Languages: ar, he

source: Privacy Policy
ar: سياسة الخصوصية
he: מדיניות פרטיות

# privacy_intro
source: We are committed to protecting your data privacy and security. This policy explains how we handle your personal information.
ar: نحن ملتزمون بحماية خصوصية بياناتك وأمانها. توضح سياسة البيانات هذه كيفية تعاملنا مع بياناتك الشخصية.
he: אנו מחויבים לשמור על פרטיות המידע שלך ובטיחותו. מדיניות זו מסבירה כיצד אנו מטפלים במידע האישי שלך.

source: Data Collection
ar: جمع البيانات
he: איסוף מידע

# data_collection_desc
source: We collect data to provide and improve our services, personalize your experience, and keep you informed.
ar: نقوم بجمع البيانات لتوفير خدماتنا وتحسينها، وتخصيص تجربتك، وإبقاءك على اطلاع بالتحديثات.
he: אנו אוספים מידע כדי לספק ולשפר את השירותים שלנו, להתאים אישית את החוויה שלך ולהשאיר אותך מעודכן.

source: Data Usage
ar: استخدام البيانات
he: שימוש במידע

# data_usage_desc
source: Collected data is used solely to enhance app functionality, ensure security, and meet legal obligations.
ar: يتم استخدام البيانات التي نجمعها فقط لتحسين وظائف التطبيق لدينا، وضمان الأمان، والامتثال للالتزامات القانونية.
he: המידע שנאסף משמש רק לשיפור תפקוד האפליקציה, שמירה על אבטחה ועמידה בדרישות החוק.

source: Data Sharing
ar: مشاركة البيانات
he: שיתוף מידע

# data_sharing_desc
source: Your data will not be shared with third parties unless legally required.
ar: لن يتم مشاركة بياناتك مع أي طرف ثالث إلا إذا كان ذلك ضرورياً لأغراض قانونية.
he: המידע שלך לא ישותף עם צדדים שלישיים אלא אם כן נדרש על פי חוק.

source: Data Retention
ar: الاحتفاظ بالبيانات
he: שמירת מידע

# data_retention_desc
source: We retain your data as long as you use our services or as required by law. You can request data deletion.
ar: نحتفظ ببياناتك طالما تستخدم خدماتنا أو حسبما يقتضيه القانون. يمكنك طلب حذف البيانات عن طريق الاتصال بنا.
he: אנו שומרים את המידע שלך כל עוד אתה משתמש בשירותים שלנו או כנדרש על פי חוק. תוכל לבקש מחיקה.

source: Phone Number
ar: رقم الهاتف
he: מספר טלפון

source: User Rights
ar: حقوق المستخدم
he: זכויות משתמש

# user_rights_desc
source: You have the right to access, modify, and delete your data. Contact us for any concerns or requests.
ar: لديك الحق في الوصول إلى بياناتك وتعديلها وحذفها. يرجى التواصل معنا إذا كانت لديك أي مخاوف أو طلبات.
he: יש לך את הזכות לגשת, לעדכן ולמחוק את המידע שלך. צור קשר אם יש לך בקשות או חששות.

# thank_you
source: Thank you for trusting us with your information. We strive to keep your data safe and transparent.
ar: نشكرك على ثقتك بنا فيما يتعلق بمعلوماتك. نحن نسعى جاهدين للحفاظ على بياناتك آمنة وشفافة.
he: תודה על האמון שלך. אנו עושים הכל כדי לשמור על פרטיותך.

# contact_support
source: For more details, feel free to contact our support team.
ar: لمزيد من التفاصيل، لا تتردد في الاتصال بفريق الدعم لدينا.
he: למידע נוסף, ניתן לפנות לצוות התמיכה שלנו.

source: Merchant Dashboard
ar: لوحة التاجر
he: לוח סוחר

source: Dark Mode
ar: وضع الليل
he: מצב כהה

source: Sunny Mode
ar: وضع النهار
he: מצב מואר

source: Language
ar: اللغة
he: שפה

source: Main
ar: الرئيسية
he: ראשי

source: Parcels
ar: الطرود
he: חבילות

source: Settings
ar: الاعدادات
he: הגדרות

source: Notifications
ar: الإشعارات
he: התראות

# general_serach_hint
source: Search...
ar: بحث...
he: חפש...

source: Clear selection
ar: مسح الاختيار
he: נקה בחירה

source: Add Parcel
ar: إضافة طرد
he: הוסף חבילה

source: Recipient Name
ar: اسم المستلم
he: שם המקבל

source: Recipient Phone
ar: رقم المستلم
he: מספר טלפון של המקבל

# alt_phone
source: Alternate Phone (Optional)
ar: رقم بديل (اختياري)
he: מספר נוסף (לא חובה)

source: Region
ar: المنطقة
he: אזור

# address
source: Address, City - Street
ar: العنوان, مدينة - شارع
he: כתובת, עיר - רחוב

# parcel_price
source: Parcel Price (without delivery)
ar: سعر الطرد (بدون التوصيل)
he: מחיר החבילה (ללא משלוח)

source: Parcel Description
ar: وصف الطرد
he: תיאור החבילה

source: Attach Barcode
ar: أرفق باركود
he: צרף ברקוד

# barcode_label
source: Barcode: {code}
ar: الباركود: {code}
he: ברקוד: {code}

# total_price_label
source: Total Price (with delivery)
ar: السعر الإجمالي (مع التوصيل)
he: המחיר הכולל (כולל משלוח)

source: Save Parcel
ar: حفظ الطرد
he: שמור חבילה

# choose_region_warning
source: Please select a region
ar: يرجى اختيار المنطقة
he: אנא בחר אזור

# invalid_price
source: Price must be a number greater than or equal to 0
ar: السعر يجب أن يكون رقمًا أكبر من أو يساوي 0
he: המחיר חייב להיות מספר גדול או שווה ל-0

# enter_price
source: Please enter a price
ar: الرجاء إدخال السعر
he: אנא הזן מחיר

# enter_recipient_name
source: Please enter recipient name
ar: الرجاء إدخال اسم المستلم
he: אנא הזן את שם המקבל

# enter_phone
source: Please enter recipient phone
ar: الرجاء إدخال رقم المستلم
he: אנא הזן מספר טלפון של המקבל

# invalid_phone
source: Invalid phone number
ar: رقم غير صالح
he: מספר טלפון לא חוקי

# enter_address
source: Enter the address (City - Street)
ar: أدخل العنوان (مدينة - شارع)
he: הזן כתובת (עיר - רחוב)

source: Password
ar: الرقم السري
he: סיסמה

source: Login
ar: تسجيل الدخول
he: התחברות

source: Logout
ar: تسجيل خروج
he: התנתקות

source: Join Us
ar: انضم إلينا
he: הצטרף אלינו

# joinUsDescription
source: This page is for business owners who want to join us.
ar: هذه الصفحة مخصصة لأصحاب الأعمال الذين يرغبون في الانضمام إلينا.
he: עמוד זה מיועד לבעלי עסקים שרוצים להצטרף אלינו.

# acceptPolicyStart
source: I accept the
ar: أوافق على
he: אני מסכים ל־

source: Data Policy
ar: سياسة الخصوصية
he: מדיניות הפרטיות

source: Name
ar: الاسم
he: שם

source: Message
ar: الرسالة
he: הודעה

source: Submit
ar: إرسال
he: שלח

# validation_phone_required
source: Please enter your phone number
ar: يرجى إدخال رقم الهاتف
he: אנא הזן מספר טלפון

# validation_phone_invalid
source: Phone number must be exactly 10 digits
ar: يجب أن يتكون الرقم من 10 أرقام إنجليزية
he: מספר הטלפון חייב להכיל בדיוק 10 ספרות

source: ⚠ No internet connection
ar: ⚠ لا يوجد اتصال بالإنترنت
he: ⚠ אין חיבור לאינטרנט

# app_name
source: Wasslni Plus
ar: وصلني بلس

# app_tagline
source: Fast & Reliable Delivery
ar: توصيل سريع وموثوق

# welcome_to_app
source: Welcome to Wasslni Plus
ar: مرحباً بك في وصلني بلس

source: Email
ar: البريد الإلكتروني

# enter_email
source: Please enter email
ar: الرجاء إدخال البريد الإلكتروني

# invalid_email
source: Invalid email address
ar: بريد إلكتروني غير صالح

# enter_password
source: Please enter password
ar: الرجاء إدخال كلمة المرور

source: Register
ar: تسجيل جديد

source: Role
ar: الدور

source: Merchant
ar: تاجر

source: Courier
ar: مندوب توصيل

source: Customer
ar: زبون

source: Login Failed
ar: فشل تسجيل الدخول

source: Registration Failed
ar: فشل التسجيل

source: Success
ar: نجاح

# already_have_account
source: Already have an account? Login
ar: لديك حساب بالفعل؟ تسجيل الدخول

# dont_have_account
source: Don't have an account? Register
ar: ليس لديك حساب؟ تسجيل جديد

# logout_confirmation
source: Are you sure you want to logout?
ar: هل أنت متأكد من تسجيل الخروج؟

source: Cancel
ar: إلغاء

# logout_error
source: Error logging out. Please try again.
ar: خطأ في تسجيل الخروج. يرجى المحاولة مرة أخرى.

source: Pending
ar: قيد الانتظار

source: In Transit
ar: قيد التوصيل

source: Delivered
ar: تم التوصيل

source: Cancelled
ar: ملغى

source: Monthly Revenue
ar: الإيرادات الشهرية

source: Recent Parcels
ar: الطرود الأخيرة

source: View All
ar: عرض الكل

source: No parcels yet
ar: لا توجد طرود بعد

source: Recipient
ar: المستلم

source: Delivery Region
ar: منطقة التوصيل

# mark_all_read
source: Mark all as read
ar: تحديد الكل كمقروء

source: No notifications
ar: لا توجد إشعارات

source: All
ar: الكل

source: Unread
ar: غير مقروء

source: Delete
ar: حذف

source: Edit Parcel
ar: تعديل الطرد

source: Update Parcel
ar: تحديث الطرد

source: Cancel Parcel
ar: إلغاء الطرد

# confirm_cancel_parcel
source: Are you sure you want to cancel this parcel?
ar: هل أنت متأكد من إلغاء هذا الطرد؟

source: Cancellation Reason
ar: سبب الإلغاء

source: Yes, Cancel
ar: نعم، إلغاء

source: No
ar: لا

# parcel_updated_success
source: Parcel updated successfully
ar: تم تحديث الطرد بنجاح

# parcel_created_success
source: Parcel created successfully
ar: تم إنشاء الطرد بنجاح

# parcel_cancelled_success
source: Parcel cancelled successfully
ar: تم إلغاء الطرد بنجاح

# error_occurred
source: Error: {error}
ar: حدث خطأ: {error}

source: Parcel Details
ar: تفاصيل الطرد

# status_label
source: Status: {status}
ar: الحالة: {status}

source: Delivery Fee
ar: رسوم التوصيل

source: History
ar: السجل

# note_label
source: Note: {note}
ar: ملاحظة: {note}

# weight
source: Weight (kg)
ar: الوزن (كجم)

# dimensions
source: Dimensions (cm)
ar: الأبعاد (سم)

source: Length
ar: الطول

source: Width
ar: العرض

source: Height
ar: الارتفاع

# delivery_instructions
source: Delivery Instructions (Optional)
ar: تعليمات التوصيل (اختياري)

source: Optional
ar: اختياري

source: Images
ar: الصور

source: Add Image
ar: إضافة صورة

# delivery_time_slot
source: Preferred Delivery Time
ar: وقت التوصيل المفضل

# morning
source: Morning (9AM - 12PM)
ar: صباحاً (9ص - 12م)

# afternoon
source: Afternoon (12PM - 5PM)
ar: ظهراً (12م - 5م)

# evening
source: Evening (5PM - 9PM)
ar: مساءً (5م - 9م)

source: Any Time
ar: أي وقت

# requires_signature
source: Requires Recipient Signature
ar: يتطلب توقيع المستلم

# signature_description
source: Courier must collect signature on delivery
ar: يجب على المندوب جمع التوقيع عند التسليم

source: Print Label
ar: طباعة الملصق

source: Print Receipt
ar: طباعة الإيصال

source: Shipping Label
ar: ملصق الشحن

source: From
ar: من

source: To
ar: إلى

# parcel_info
source: Parcel Information
ar: معلومات الطرد

source: Scan to Track
ar: امسح للتتبع

source: Export
ar: تصدير

# export_pdf
source: Export to PDF
ar: تصدير إلى PDF

# export_excel
source: Export to Excel
ar: تصدير إلى Excel

# export_success
source: Export completed successfully
ar: تم التصدير بنجاح

# export_error
source: Export failed
ar: فشل التصدير

source: Parcels Report
ar: تقرير الطرود

source: Total Parcels
ar: إجمالي الطرود

source: Date Range
ar: نطاق التاريخ

source: Bulk Upload
ar: رفع جماعي

# upload_csv
source: Upload CSV File
ar: رفع ملف CSV

source: Download Template
ar: تنزيل النموذج

source: Select File
ar: اختر ملف

# upload_success
source: Upload completed successfully
ar: تم الرفع بنجاح

# upload_error
source: Upload failed
ar: فشل الرفع

source: Processing file...
ar: جاري معالجة الملف...

source: Parcels imported
ar: تم استيراد الطرود

source: Reports
ar: التقارير

source: Analytics
ar: التحليلات

source: Monthly Report
ar: التقرير الشهري

source: Delivery Statistics
ar: إحصائيات التوصيل

source: Revenue Overview
ar: نظرة عامة على الإيرادات

source: Performance Metrics
ar: مقاييس الأداء

source: Select Month
ar: اختر الشهر

source: Total Deliveries
ar: إجمالي التوصيلات

source: Successful Deliveries
ar: التوصيلات الناجحة

source: Failed Deliveries
ar: التوصيلات الفاشلة

source: Pending Deliveries
ar: التوصيلات المعلقة

source: Success Rate
ar: معدل النجاح

source: Average Delivery Time
ar: متوسط وقت التوصيل

source: Total Revenue
ar: إجمالي الإيرادات

source: Delivery Fees Collected
ar: رسوم التوصيل المحصلة

source: Success Rate Trend
ar: اتجاه معدل النجاح

source: Weekly Success Rate
ar: معدل النجاح الأسبوعي

source: No data available
ar: لا توجد بيانات متاحة

source: Top Customers
ar: أفضل العملاء

source: Parcels Delivered
ar: الطرود التي تم توصيلها

source: Notification Settings
ar: إعدادات الإشعارات

source: Parcel Updates
ar: تحديثات الطرود

# parcel_updates_desc
source: Get notified when parcel status changes
ar: احصل على إشعار عند تغيير حالة الطرد

source: Promotional Offers
ar: العروض الترويجية

# promotional_offers_desc
source: Receive updates about new features and offers
ar: تلقي تحديثات حول الميزات والعروض الجديدة

source: System Announcements
ar: إعلانات النظام

# system_announcements_desc
source: Important updates about the platform
ar: تحديثات مهمة حول المنصة

source: Courier Dashboard
ar: لوحة السائق

source: Daily Assignments
ar: المهام اليومية

source: Today's Deliveries
ar: توصيلات اليوم

source: Earnings Today
ar: الأرباح اليوم

source: Completed
ar: مكتمل

source: Pending Pickup
ar: في انتظار الاستلام

source: My Route
ar: مسار التوصيل

source: Start Delivery
ar: بدء التوصيل

# no_assignments
source: No assignments for today
ar: لا توجد مهام لهذا اليوم

source: Route Map
ar: خريطة المسار

source: Delivery Points
ar: نقاط التوصيل

source: Navigate
ar: التنقل

source: Map View
ar: عرض الخريطة

source: List View
ar: عرض القائمة

source: Delivery Location
ar: موقع التوصيل

source: Current Location
ar: الموقع الحالي

source: Show Route
ar: إظهار المسار

source: Hide Route
ar: إخفاء المسار

source: Optimized Route
ar: المسار الأمثل

source: Distance
ar: المسافة

source: Estimated Time
ar: الوقت المتوقع

source: Weekly Earnings
ar: الأرباح الأسبوعية

source: Monthly Earnings
ar: الأرباح الشهرية

source: Total Earnings
ar: إجمالي الأرباح

source: Earnings Breakdown
ar: تفصيل الأرباح

source: Today's Performance
ar: أداء اليوم

source: Delivery Success Rate
ar: معدل نجاح التوصيل

source: Failed
ar: فشل

source: minutes
ar: دقائق

source: hours
ar: ساعات

source: days
ar: أيام

source: View Details
ar: عرض التفاصيل

source: Performance
ar: الأداء

source: This Week
ar: هذا الأسبوع

source: This Month
ar: هذا الشهر

source: Earnings Trend
ar: اتجاه الأرباح

source: Statistics
ar: الإحصائيات

source: Delivery Queue
ar: قائمة التوصيل

source: No Active Deliveries
ar: لا توجد توصيلات نشطة

# all_caught_up
source: You're all caught up!
ar: أنت على اطلاع بكل شيء!

source: Call
ar: اتصال

source: Delivery Checklist
ar: قائمة التحقق من التوصيل

# complete_steps_to_proceed
source: Complete the following steps to proceed
ar: أكمل الخطوات التالية للمتابعة

source: Verify Recipient
ar: التحقق من المستلم

source: Confirm Location
ar: تأكيد الموقع

source: Check Package Condition
ar: فحص حالة الطرد

# ensure_no_damage
source: Ensure there is no visible damage
ar: تأكد من عدم وجود تلف ظاهر

source: Collect Payment
ar: تحصيل الدفع

# proceed_to_proof
source: Proceed to Proof of Delivery
ar: المتابعة إلى إثبات التوصيل

source: Proof of Delivery
ar: إثبات التسليم

# take_photo_proof
source: Take a photo of the delivered package
ar: التقط صورة للطرد الذي تم توصيله

source: Take Photo
ar: التقاط صورة

source: Retake
ar: إعادة التقاط

source: Confirm Delivery
ar: تأكيد التوصيل

source: Uploading...
ar: جاري الرفع...

source: Delivery completed successfully!
ar: تم التوصيل بنجاح!

source: Signature Required
ar: التوقيع مطلوب

source: Please sign below
ar: الرجاء التوقيع أدناه

source: Clear Signature
ar: مسح التوقيع

source: Confirm Signature
ar: تأكيد التوقيع

# signature_uploaded
source: Signature uploaded successfully
ar: تم رفع التوقيع بنجاح

source: Delivery History
ar: سجل التوصيل

# no_history_found
source: No delivery history found
ar: لا يوجد سجل توصيل

source: Error loading data
ar: خطأ في تحميل البيانات

source: Returned
ar: مرتجع

source: Timeline
ar: الجدول الزمني

source: Created At
ar: تاريخ الإنشاء

source: Delivered At
ar: تاريخ التوصيل

source: Notes
ar: ملاحظات

source: Signature
ar: التوقيع

source: Update Status
ar: تحديث الحالة

source: Select Status
ar: اختر الحالة

source: Return Reason
ar: سبب الإرجاع

source: Failure Reason
ar: سبب الفشل

source: Mark as Delivered
ar: تحديد كتم التوصيل

source: Mark as Returned
ar: تحديد كمرتجع

source: Mark as Cancelled
ar: تحديد كملغى

source: Mark as Ready to Ship
ar: تحديد كجاهز للشحن

source: Mark as Out for Delivery
ar: تحديد كخارج للتوصيل

source: Mark as At Warehouse
ar: تحديد كفي المخزن

source: Status updated successfully
ar: تم تحديث الحالة بنجاح

# please_enter_reason
source: Please enter a reason
ar: الرجاء إدخال سبب

source: Confirm Status Update
ar: تأكيد تحديث الحالة

# are_you_sure_update_status
source: Are you sure you want to update the status to {status}?
ar: هل أنت متأكد من تحديث الحالة إلى {status}؟

source: Yes, Update
ar: نعم، تحديث

# status_awaiting_label
source: Awaiting Label
ar: بانتظار الملصق

# status_ready_to_ship
source: Ready to Ship
ar: جاهز للشحن

# status_at_warehouse
source: At Distributor's Warehouse
ar: في المخزن

# status_en_route_distributor
source: En Route to Distributor
ar: في الطريق للموزع

# status_out_for_delivery
source: Out for Delivery
ar: خرج للتوصيل

source: Confirm
ar: تأكيد

source: Complete Delivery
ar: إكمال التوصيل

source: Route Optimized
ar: تم تحسين المسار

source: Availability
ar: التوفر

source: Online
ar: متصل

source: Offline
ar: غير متصل

# vehicle_info
source: Vehicle Information
ar: معلومات المركبة

source: Vehicle Type
ar: نوع المركبة

# vehicle_plate
source: Vehicle Plate Number
ar: رقم اللوحة

source: Working Regions
ar: مناطق العمل

# validation_required
source: This field is required
ar: هذا الحقل مطلوب

source: Save Changes
ar: حفظ التغييرات

# profile_updated_success
source: Profile updated successfully
ar: تم تحديث الملف الشخصي بنجاح

source: Active Deliveries
ar: التوصيلات النشطة

# updated_at
source: Last Updated
ar: آخر تحديث

source: Order History
ar: سجل الطلبات

source: Search by barcode or name...
ar: البحث بواسطة الباركود أو الاسم...

source: No results found
ar: لم يتم العثور على نتائج

source: Reorder
ar: إعادة الطلب

source: Reorder Parcel
ar: إعادة طلب الطرد

source: Original Order Details
ar: تفاصيل الطلب الأصلي

# merchant_info
source: Merchant Information
ar: معلومات التاجر

# merchant_info_unavailable
source: Merchant information unavailable
ar: معلومات التاجر غير متوفرة

# reorder_instructions
source: Contact the merchant to place a repeat order with the same delivery details
ar: اتصل بالتاجر لتقديم طلب جديد بنفس تفاصيل التوصيل

source: Call Merchant
ar: الاتصال بالتاجر

source: Copy Number
ar: نسخ الرقم

source: Delivery Feedback
ar: تقييم التوصيل

# rate_delivery_experience
source: Rate Your Delivery Experience
ar: قيّم تجربة التوصيل

source: How was your delivery?
ar: كيف كانت تجربة التوصيل؟

# add_comment
source: Add Comment (Optional)
ar: إضافة تعليق (اختياري)

# share_your_experience
source: Share your experience with this delivery...
ar: شارك تجربتك مع هذا التوصيل...

# tip_courier
source: Tip Your Courier
ar: إكرامية للسائق

# tip_courier_description
source: Show appreciation for great service (optional)
ar: أظهر تقديرك للخدمة الممتازة (اختياري)

source: No Tip
ar: بدون إكرامية

source: Submit Feedback
ar: إرسال التقييم

source: Submitting...
ar: جاري الإرسال...

# please_select_rating
source: Please select a rating
ar: الرجاء اختيار تقييم

# courier_not_assigned
source: Courier not assigned to this parcel
ar: لم يتم تعيين سائق لهذا الطرد

source: Feedback submitted successfully!
ar: تم إرسال التقييم بنجاح!

# rating_poor
source: Poor
ar: ضعيف

# rating_fair
source: Fair
ar: مقبول

# rating_good
source: Good
ar: جيد

# rating_very_good
source: Very Good
ar: جيد جداً

# rating_excellent
source: Excellent!
ar: ممتاز!

source: Leave Feedback
ar: ترك تقييم
